##### 설정변경코드
* 변수 명이 두번 이상 출력되어도 모두 콘솔에서 보여줄 것
* 
from IPython.core.interactiveshell import InteractiveShell <br> 
InteractiveShell.ast_node_interactivity="all"
* InteractiveShell.ast_node_interactivity : 'all' | 'last' | 'last_expr' | 'none' (기본값은 'last_expr')

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

#### 데이터 프레임 인덱서 : loc, iloc
- Pandas는 numpy행렬과 같이 쉼표를 사용한 (행 인덱스, 열 인덱스) 형식의 2차원 인덱싱을 지원
    - 특별한 인덱서(indexer) 속성을 제공
    
* loc : 라벨값 기반의 2차원 인덱싱
* iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

### 행과 열을 동시에 인덱싱 하는 경우  df는 열우선 인덱싱 진행 
- df['열']
- df[:'행'] 슬라이싱 반드시 필요
- df['열'][:'행']

##### 인덱서 : 행우선 인덱싱이 가능 
df.loc[행인덱싱값]
df.loc[행,열]

#### 인덱싱 값
    1. 인덱스 데이터(index name, column name)
    2. 인덱스 데이터 슬라이스
    3. 같은 행 인덱스를 갖는 불리언 시리즈(행 인덱싱인 경우)
        - 조건으로 추출 가능
    4. 위 값을 반환하는 함수

### 연습문제
1. 모든행과 열에 라벨을 가지는 5*5 이상 크기의 데이터 프레임을 만든다. (최대한 간단한 코드로 작성-np의 난수 발생 함수 이용)
2. 10가지 이상의 방법으로 특정한 행과 열을 추출해 볼 것
    - 2번 작업을 진행하면서 주석으로 추출하는 내용을 정리 할 것

In [2]:
# 필요 패키지 임포트
import pandas as pd
import numpy as np

In [3]:
#25,50 범위의 숫자를 생성 후 5행 5열로 배치
df=pd.DataFrame(np.arange(25,50).reshape(5,5),
               index = ['a','b','c','d','e'],
               columns = ["A","B","C","D","E"])
df

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [14]:
# 위 df에 대하여 아래 내용을 인덱싱 하세요(인덱서를 우선 사용)

df['A'] #열 라벨 인덱싱, A열을 추출 - 시리즈

df[0:3] #0행부터 2행까지 추출-슬라이싱 사용(행인덱싱)

df['A']['a'] #열행 인덱싱 - 원소값 a행 A열-열우선인덱싱

df.iloc[1,3:]#1행의 3,4열(D,E열)

df.loc['a':'c','B':'D']#a행부터 c행, B열부터 D열을 df로 반환(행,열 모두 슬라이싱처리)

df.iloc[-2:] #끝에서 두번째 행부터 마지막행까지 - df로 반환

df.loc['a','A':'B']#a 행의  A부터 B열 - 시리즈로 반환

df.loc["a":"a","A":"B"]#a 행의  A부터 B열 df로 반환

df.iloc[-2:,-2:]#끝에서 두번째 행부터 마지막 행까지 끝에서 두번째 열부터 마지막 열까지

df[:'b']['A'] #a,b행의 A열(시리즈)
df[:'b'][['A']] # a,b행의 A열(df)

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int32

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

25

D    33
E    34
Name: b, dtype: int32

    B   C   D
a  26  27  28
b  31  32  33
c  36  37  38

    A   B   C   D   E
d  40  41  42  43  44
e  45  46  47  48  49

A    25
B    26
Name: a, dtype: int32

    A   B
a  25  26

    D   E
d  43  44
e  48  49

a    25
b    30
Name: A, dtype: int32

    A
a  25
b  30